app/controllers/movies_controller.rb

  def index

    @sort = params[:sort]
    @ratings = params[:ratings]

    ratings = @ratings.nil? ? Movie.ratings : @ratings.keys

    @all_ratings = ratings.inject(Hash.new) do |all, rating|
      all[rating] = @ratings.nil? ? false : @ratings.has_key?(rating)
      all
    end

    if !@sort.nil?
      @movies = Movie.order("#{@sort} ASC")
    else
      @movies = Movie.find_all_by_rating(ratings)
---
SELECT "movies".* FROM "movies" ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date ASC